site/backend-yii2/frontend/controllers/SiteController.php

SELECT * FROM `file` WHERE `storage`='local'
SELECT * FROM `file` WHERE `storage`='s3'
---
    public function actionIndex()
    {
        $storageFileUploadForm = new StorageFileUploadForm();
        $s3FileUploadForm = new S3FileUploadForm();

        return $this->render('index', [
            'storageFileUploadForm' => $storageFileUploadForm,
            's3FileUploadForm' => $s3FileUploadForm,
            'localFiles' => File::find()->where(['storage' => File::LOCAL_STORAGE])->all(),
            's3Files' => File::find()->where(['storage' => File::S3_STORAGE])->all(),